app/Controllers/ProdutoController.php

    public function create(){
        helper('form');

        $data = $this->request->getPost(['nome', 'preco', 'estoque', 'imagem', 'descricao']);

        if(!$this->validateData($data, [
            'nome' => 'required|max_length[255]',
            'preco' => 'required',
            'estoque' => 'required',
            'descricao' => 'required',
        ])){
            return $this->new();
        }

        $post = $this->validator->getValidated();
        $model = model(ProdutoModel::class);

        $model->save([
            'nome' => $post['nome'],
            'preco' => $post['preco'],
            'estoque' => $post['estoque'],
            'imagem' => 'teste',
            'descricao' => $post['descricao']
        ]);
---
INSERT INTO `produto` (`nome`, `preco`, `estoque`, `imagem`, `descricao`) VALUES ('Arroz', '23', '24', 'teste', 'Muito bom')