app/Models/CarrinhoModel.php

    public function getProdutos($slug = false){
        if($slug == false){
            return $this->findAll();
---
SELECT *
FROM `carrinho`